; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	image0 - mode
	thermograph1 - mode
	image3 - mode
	thermograph2 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star2 - direction
	Star6 - direction
	GroundStation4 - direction
	Star7 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 image0)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image0)
	(supports instrument2 image3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument5 thermograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star7)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 image3)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument8 thermograph2)
	(supports instrument8 image0)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 Star6)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star6)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph1)
	(supports instrument9 image3)
	(calibration_target instrument9 GroundStation1)
	(calibration_target instrument9 Star7)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet13)
	(supports instrument10 image0)
	(supports instrument10 image3)
	(calibration_target instrument10 GroundStation5)
	(on_board instrument10 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star7)
)
(:goal (and
	(pointing satellite0 Star7)
	(pointing satellite4 Phenomenon9)
	(pointing satellite5 GroundStation1)
	(pointing satellite6 Star10)
	(have_image Phenomenon8 thermograph2)
	(have_image Phenomenon9 thermograph1)
	(have_image Star10 thermograph2)
	(have_image Star11 thermograph1)
	(have_image Star12 image0)
	(have_image Planet13 thermograph1)
))

)

; plan
1. (turn_to satellite5 groundstation1 planet13)
   deleted: (pointing satellite5 planet13)
   added: (pointing satellite5 groundstation1)
   goals met: 1 of 10
2. (turn_to satellite4 phenomenon9 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 phenomenon9)
   goals met: 2 of 10
3. (turn_to satellite3 groundstation1 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 groundstation1)
   goals met: 2 of 10
4. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 2 of 10
5. (calibrate satellite3 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 2 of 10
6. (turn_to satellite3 planet13 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet13)
   goals met: 2 of 10
7. (take_image satellite3 planet13 instrument6 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 3 of 10
8. (turn_to satellite3 phenomenon9 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 phenomenon9)
   goals met: 3 of 10
9. (take_image satellite3 phenomenon9 instrument6 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 4 of 10
10. (turn_to satellite3 phenomenon8 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon8)
   goals met: 4 of 10
11. (turn_to satellite0 star7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star7)
   goals met: 5 of 10
12. (take_image satellite3 phenomenon8 instrument6 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 6 of 10
13. (turn_to satellite3 star10 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star10)
   goals met: 6 of 10
14. (take_image satellite3 star10 instrument6 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 7 of 10
15. (turn_to satellite3 star11 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star11)
   goals met: 7 of 10
16. (take_image satellite3 star11 instrument6 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 8 of 10
17. (turn_to satellite3 star12 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star12)
   goals met: 8 of 10
18. (take_image satellite3 star12 instrument6 image0)
   added: (have_image star12 image0)
   goals met: 9 of 10
19. (turn_to satellite6 star10 star7)
   deleted: (pointing satellite6 star7)
   added: (pointing satellite6 star10)
   goals met: 10 of 10
